In [13]:
import sys
sys.path.append('C:/Users/mdmur/OneDrive/Pictures/MohasProject/venv/Lib/site-packages')

%matplotlib inline

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [16]:
import os, re

In [17]:
os.listdir('./data/')

['Sales_April_2019.csv',
 'Sales_August_2019.csv',
 'Sales_December_2019.csv',
 'Sales_February_2019.csv',
 'Sales_January_2019.csv',
 'Sales_July_2019.csv',
 'Sales_June_2019.csv',
 'Sales_March_2019.csv',
 'Sales_May_2019.csv',
 'Sales_November_2019.csv',
 'Sales_October_2019.csv',
 'Sales_September_2019.csv']

In [18]:
df_jan = pd.read_csv('./data/Sales_January_2019.csv')
df_feb = pd.read_csv('./data/Sales_February_2019.csv')
df_mar = pd.read_csv('./data/Sales_March_2019.csv')
df_apr = pd.read_csv('./data/Sales_April_2019.csv')
df_may = pd.read_csv('./data/Sales_May_2019.csv')
df_jun = pd.read_csv('./data/Sales_June_2019.csv')
df_jul = pd.read_csv('./data/Sales_July_2019.csv')
df_aug = pd.read_csv('./data/Sales_August_2019.csv')
df_sep = pd.read_csv('./data/Sales_September_2019.csv')
df_oct = pd.read_csv('./data/Sales_October_2019.csv')
df_nov = pd.read_csv('./data/Sales_November_2019.csv')
df_dec = pd.read_csv('./data/Sales_December_2019.csv')

In [19]:
df_jan.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"

In [20]:
df_jan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9723 entries, 0 to 9722
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          9697 non-null   object
 1   Product           9697 non-null   object
 2   Quantity Ordered  9697 non-null   object
 3   Price Each        9697 non-null   object
 4   Order Date        9697 non-null   object
 5   Purchase Address  9697 non-null   object
dtypes: object(6)
memory usage: 455.9+ KB

In [21]:
print(f"Jan: {df_jan.shape}")
print(f"Feb: {df_feb.shape}")
print(f"Mar: {df_mar.shape}")
print(f"Apr: {df_apr.shape}")
print(f"May: {df_may.shape}")
print(f"Jun: {df_jun.shape}")
print(f"Jul: {df_jul.shape}")
print(f"Aug: {df_aug.shape}")
print(f"Sep: {df_sep.shape}")
print(f"Oct: {df_oct.shape}")
print(f"Nov: {df_nov.shape}")
print(f"Dec: {df_dec.shape}")

Jan: (9723, 6)
Feb: (12036, 6)
Mar: (15226, 6)
Apr: (18383, 6)
May: (16635, 6)
Jun: (13622, 6)
Jul: (14371, 6)
Aug: (12011, 6)
Sep: (11686, 6)
Oct: (20379, 6)
Nov: (17661, 6)
Dec: (25117, 6)

In [22]:
df_all = pd.DataFrame()

for file in os.listdir('./data/'):
    df_temp = pd.read_csv('./data/'+file)
    df_all = pd.concat([df_all, df_temp])
    
df_all.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [23]:
# copy
df_all_clean = df_all.copy()

In [24]:
df_all_clean.isna().value_counts()

Order ID  Product  Quantity Ordered  Price Each  Order Date  Purchase Address
False     False    False             False       False       False               186305
True      True     True              True        True        True                   545
Name: count, dtype: int64

In [25]:
df_all_clean.dropna(inplace=True)

In [26]:
df_all_clean.shape

(186305, 6)

In [27]:
df_all_clean.isna().value_counts()

Order ID  Product  Quantity Ordered  Price Each  Order Date  Purchase Address
False     False    False             False       False       False               186305
Name: count, dtype: int64

In [28]:
df_all_clean.rename(columns=lambda x: x.lower().replace(' ','_'), inplace=True)

In [29]:
for column in df_all_clean.columns:
    print(column)

order_id
product
quantity_ordered
price_each
order_date
purchase_address

In [30]:
df_all_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 186305 entries, 0 to 11685
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   order_id          186305 non-null  object
 1   product           186305 non-null  object
 2   quantity_ordered  186305 non-null  object
 3   price_each        186305 non-null  object
 4   order_date        186305 non-null  object
 5   purchase_address  186305 non-null  object
dtypes: object(6)
memory usage: 9.9+ MB

In [31]:
df_all_clean.quantity_ordered.value_counts()

quantity_ordered
1                   168552
2                    13324
3                     2920
4                      806
Quantity Ordered       355
5                      236
6                       80
7                       24
8                        5
9                        3
Name: count, dtype: int64

In [32]:
df_all_clean.query('quantity_ordered == "Quantity Ordered"')

,order_id,product,quantity_ordered,price_each,order_date,purchase_address
519,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1149,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1155,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
2878,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
2893,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
...,...,...,...,...,...,...
10000,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
10387,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
11399,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
11468,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
11574,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address

In [33]:
df_all_clean.drop(df_all_clean.index[df_all_clean.quantity_ordered == "Quantity Ordered"], inplace = True)

In [34]:
df_all_clean.query('quantity_ordered == "Quantity Ordered"')

Empty DataFrame
Columns: [order_id, product, quantity_ordered, price_each, order_date, purchase_address]
Index: []

In [35]:
df_all_clean.quantity_ordered = df_all_clean.quantity_ordered.astype(int)
df_all_clean.price_each = df_all_clean.price_each.astype(float)

In [39]:
df_all_clean.order_date = pd.to_datetime(df_all_clean.order_date)

In [40]:
df_all_clean.info()

<class 'pandas.core.frame.DataFrame'>
Index: 182735 entries, 0 to 11685
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   order_id          182735 non-null  object
 1   product           182735 non-null  object
 2   quantity_ordered  182735 non-null  int32
 3   price_each        182735 non-null  float64
 4   order_date        182735 non-null  datetime64[ns]
 5   purchase_address  182735 non-null  object
 6   month             182735 non-null  object
dtypes: datetime64[ns](1), float64(1), int32(1), object(4)
memory usage: 10.5+ MB

In [41]:
df_all_clean['month'] = df_all_clean.order_date.dt.month_name()

In [42]:
df_all_clean.head()

,order_id,product,quantity_ordered,price_each,order_date,purchase_address,month
0,176558,USB-C Charging Cable,2,11.95,2019-04-19 08:46:00,"917 1st St, Dallas, TX 75001",April
2,176559,Bose SoundSport Headphones,1,99.99,2019-04-07 22:30:00,"682 Chestnut St, Boston, MA 02215",April
3,176560,Google Phone,1,600.00,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001",April
4,176560,Wired Headphones,1,11.99,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001",April
5,176561,Wired Headphones,1,11.99,2019-04-30 09:27:00,"333 8th St, Los Angeles, CA 90001",April

In [43]:
df_all_clean['total_sales'] = df_all_clean.quantity_ordered * df_all_clean.price_each

In [44]:
df_all_clean.sample(5)

,order_id,product,quantity_ordered,price_each,order_date,purchase_address,month,total_sales
11290,172793,27in 4K Gaming Monitor,1,389.99,2019-03-09 20:13:00,"732 Lake St, Seattle, WA 98101",March,389.99
18161,193885,Macbook Pro Laptop,1,1700.00,2019-04-16 08:47:00,"837 6th St, Austin, TX 73301",April,1700.00
3717,165545,AA Batteries (4-pack),1,3.84,2019-03-23 13:15:00,"612 Adams St, Austin, TX 73301",March,3.84
15846,209182,AAA Batteries (4-pack),1,2.99,2019-05-07 12:30:00,"499 River St, Los Angeles, CA 90001",May,2.99
3460,239995,Apple Airpods Headphones,1,150.00,2019-08-25 06:55:00,"200 Sunset St, Seattle, WA 98101",August,150.00

In [45]:
df_all_clean.drop('purchase_address', axis=1, inplace=True)

In [46]:
total_quantity_sold = df_all_clean.groupby('product')['quantity_ordered'].sum().reset_index()
total_quantity_sold.rename(columns={'quantity_ordered': 'total_quantity_sold_all_months'}, inplace=True)

In [47]:
df_all_clean = pd.merge(df_all_clean, total_quantity_sold, on='product', how='left')

In [48]:
df_all_clean.sample(5)

,order_id,product,quantity_ordered,price_each,order_date,month,total_sales,total_quantity_sold_all_months
104605,163641,ThinkPad Laptop,1,999.99,2019-03-07 12:14:00,March,999.99,4054
55532,151613,AA Batteries (4-pack),1,3.84,2019-02-13 20:28:00,February,3.84,27148
110119,169054,Lightning Charging Cable,1,14.95,2019-03-18 17:16:00,March,14.95,22841
26214,244738,27in 4K Gaming Monitor,1,389.99,2019-08-08 13:04:00,August,389.99,6134
156356,264238,Lightning Charging Cable,1,14.95,2019-10-16 20:14:00,October,14.95,22841

In [49]:
df_all_clean.to_csv('./output/all_data.csv', index=False)

In [50]:
df = pd.read_csv('./output/all_data.csv')
df.head()

,order_id,product,quantity_ordered,price_each,order_date,month,total_sales,total_quantity_sold_all_months
0,176558,USB-C Charging Cable,2,11.95,2019-04-19 08:46:00,April,23.90,23555
1,176559,Bose SoundSport Headphones,1,99.99,2019-04-07 22:30:00,April,99.99,13236
2,176560,Google Phone,1,600.00,2019-04-12 14:38:00,April,600.00,5440
3,176560,Wired Headphones,1,11.99,2019-04-12 14:38:00,April,11.99,20201
4,176561,Wired Headphones,1,11.99,2019-04-30 09:27:00,April,11.99,20201